In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
dframe1=DataFrame({'key':['x','z','y','z','x','x'],'data_set_1':np.arange(6)})
dframe1

   data_set_1 key
0           0   x
1           1   z
2           2   y
3           3   z
4           4   x
5           5   x

In [3]:
dframe2=DataFrame({'key':['q','y','z'],'data_set':[1,2,3]})
dframe2

   data_set key
0         1   q
1         2   y
2         3   z

In [4]:
pd.merge(dframe1,dframe2)

   data_set_1 key  data_set
0           1   z         3
1           3   z         3
2           2   y         2

In [5]:
pd.merge(dframe1,dframe2,on='key')

   data_set_1 key  data_set
0           1   z         3
1           3   z         3
2           2   y         2

In [7]:
pd.merge(dframe1,dframe2,on='key',how='left')

   data_set_1 key  data_set
0           0   x       NaN
1           1   z         3
2           2   y         2
3           3   z         3
4           4   x       NaN
5           5   x       NaN

In [8]:
pd.merge(dframe1,dframe2,on='key',how='right')

   data_set_1 key  data_set
0           1   z         3
1           3   z         3
2           2   y         2
3         NaN   q         1

In [9]:
pd.merge(dframe1,dframe2,on='key',how='outer')

   data_set_1 key  data_set
0           0   x       NaN
1           4   x       NaN
2           5   x       NaN
3           1   z         3
4           3   z         3
5           2   y         2
6         NaN   q         1

In [11]:
dframe3=DataFrame({'key':['x','x','x','y','z','z'],'data_set_3':range(6)})

In [16]:
dframe4=DataFrame({'key':['y','y','x','x','z'],'data_set_4':range(5)})

In [17]:
dframe3

   data_set_3 key
0           0   x
1           1   x
2           2   x
3           3   y
4           4   z
5           5   z

In [18]:
dframe4

   data_set_4 key
0           0   y
1           1   y
2           2   x
3           3   x
4           4   z

In [19]:
pd.merge(dframe3,dframe4)

   data_set_3 key  data_set_4
0           0   x           2
1           0   x           3
2           1   x           2
3           1   x           3
4           2   x           2
5           2   x           3
6           3   y           0
7           3   y           1
8           4   z           4
9           5   z           4

In [21]:
df_left=DataFrame({'key1':['SF','LA','SF'],'key2':['one','two','one'],'left_data':[10,20,30]})

In [22]:
df_right=DataFrame({'key1':['SF','SF','LA','LA'],'key2':['one','one','one','two'],'right_data':[40,50,60,70]})

In [23]:
df_left

  key1 key2  left_data
0   SF  one         10
1   LA  two         20
2   SF  one         30

In [24]:
df_right

  key1 key2  right_data
0   SF  one          40
1   SF  one          50
2   LA  one          60
3   LA  two          70

In [25]:
pd.merge(df_left,df_right,on=['key1','key2'],how='outer')

  key1 key2  left_data  right_data
0   SF  one         10          40
1   SF  one         10          50
2   SF  one         30          40
3   SF  one         30          50
4   LA  two         20          70
5   LA  one        NaN          60

In [26]:
pd.merge(df_left,df_right,on='key1')

  key1 key2_x  left_data key2_y  right_data
0   SF    one         10    one          40
1   SF    one         10    one          50
2   SF    one         30    one          40
3   SF    one         30    one          50
4   LA    two         20    one          60
5   LA    two         20    two          70

In [27]:
pd.merge(df_left,df_right,on='key1',suffixes=('_lefty','_righty'))

  key1 key2_lefty  left_data key2_righty  right_data
0   SF        one         10         one          40
1   SF        one         10         one          50
2   SF        one         30         one          40
3   SF        one         30         one          50
4   LA        two         20         one          60
5   LA        two         20         two          70